test/solver/incompressibleVoF/cases/vofRow4Divergent/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// The inlet supplies half of what the interior carries, so the flux
// createPhi(U) builds does not close cell-wise: div(phi) is 4 1/s in the first
// cell and the duct carries twice the mass it is fed. This is what
// initCorrectPhi.H exists to fix.
internalField   uniform (2 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
